Revit 2024 API
BuiltInFailures.SketchFailures.UnsatisfiedWallAssocProp Property
 Constraint between a Line created with Pick Wall and the Wall is not satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnsatisfiedWallAssocProp { get; }
Visual Basic
Public Shared ReadOnly Property UnsatisfiedWallAssocProp As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnsatisfiedWallAssocProp {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace